renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_hdriver.c
/******************************************************************************
 Function Name   : usb_hstd_connect_err_event_set
 Description     : Set event for "USB_STS_NOT_SUPPORT"
 Arguments       : uint16_t ip_no  : IP no.(USB_IP0/USB_IP1)
 Return          : none
 ******************************************************************************/
void usb_hstd_connect_err_event_set(uint16_t ip_no)
{
    usb_ctrl_t ctrl;

    ctrl.address = g_usb_hstd_device_addr[ip_no];       /* usb device address */
    ctrl.module = ip_no;                                /* module number setting */
    usb_set_event(USB_STS_NOT_SUPPORT, &ctrl);          /* set event()  */
}
/******************************************************************************
 End of function usb_hstd_connect_err_event_set
 ******************************************************************************/

#if defined(USB_CFG_HVND_USE)
/******************************************************************************
 Function Name   : usb_hvnd_set_pipe_registration
 Description     : Host CDC pipe registration.
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t  devadr     : Device address
 Return          : usb_er_t             : Error info
 ******************************************************************************/
usb_er_t usb_hvnd_set_pipe_registration (usb_utr_t *ptr, uint16_t dev_addr)
{
    usb_er_t    err; /* Error code */
    uint8_t     pipe_no;

    err = USB_ERROR;

    /* Device address check */
    if (0 != dev_addr)
    {
        /* Search use pipe block */
        /* WAIT_LOOP */
        for (pipe_no = USB_MIN_PIPE_NO; pipe_no < (USB_MAX_PIPE_NO +1); pipe_no++)
        {   /* Check use block */
            if (USB_TRUE == g_usb_pipe_table[ptr->ip][pipe_no].use_flag)
            {   /* Check USB Device address */
                if ((dev_addr << USB_DEVADDRBIT) == (g_usb_pipe_table[ptr->ip][pipe_no].pipe_maxp & USB_DEVSEL))
                {
                    usb_hstd_set_pipe_reg (ptr, pipe_no);
                    err = USB_OK;
                }
            }
        }
    }
    else
    {
        /* Error */
        USB_PRINTF1("SmplOpen adr error %x\n", dev_addr);
    }
    return err;
}
/******************************************************************************
 End of function usb_hvnd_set_pipe_registration()
 ******************************************************************************/


/******************************************************************************
 Function Name   : usb_hvnd_configured
 Description     : Host vendor application initialization.
 Argument        : usb_utr_t *ptr    : IP info (mode, IP no, reg. address).
 : uint16_t dev_addr : Device address.
 : uint16_t data2    : Not used.
 Return          : none
 ******************************************************************************/
void usb_hvnd_configured (usb_utr_t *ptr, uint16_t dev_addr, uint16_t data2)
{
    usb_ctrl_t ctrl;

    ctrl.module = ptr->ip; /* Module number setting */
    ctrl.address = dev_addr;
    if (0 != dev_addr)
    {

        /* Registration */
        usb_hvnd_set_pipe_registration(ptr, dev_addr); /* Host CDC Pipe registration */
    }

    usb_set_event(USB_STS_CONFIGURED, &ctrl);
}
/******************************************************************************
 End of function usb_hvnd_configured
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hvnd_detach
 Description     : Close host vendor application.
 Argument        : usb_utr_t *ptr    : IP info (mode, IP no, reg. address).
 : uint16_t data1            : Not Use
 : uint16_t data2            : Not Use
 Return          : none
 ******************************************************************************/
void usb_hvnd_detach (usb_utr_t *ptr, uint16_t dev_addr, uint16_t data2)
{
    usb_ctrl_t ctrl;

    usb_hstd_clr_pipe_table (ptr->ip, dev_addr);

    ctrl.module = ptr->ip; /* Module number setting */
    ctrl.address = dev_addr;
    usb_set_event(USB_STS_DETACH, &ctrl);
}
/******************************************************************************
 End of function usb_hvnd_detach
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hvnd_enumeration
 Description     : Vendor class example enumeration execution by host.
 Argument        : usb_clsinfo_t *mess   : Class info data pointer.
 Return          : none
 ******************************************************************************/
void usb_hvnd_enumeration (usb_clsinfo_t *mess, uint16_t **table)
{
    uint8_t *pdesc;
    uint16_t total_len;
    uint16_t speed;

    *table[3] = USB_OK;

    /* Pipe Information table set */
    speed = *table[6];
    pdesc = (uint8_t *) g_usb_hstd_config_descriptor[mess->ip];

    total_len = ((uint16_t) *(pdesc + 3)) << 8;
    total_len |= (uint16_t) *(pdesc + 2);

    /* Pipe Information table set */
    usb_hvnd_pipe_info(pdesc, speed, total_len);

#if (BSP_CFG_RTOS_USED == 0)
    usb_hstd_return_enu_mgr(mess, USB_OK); /* Return to MGR */
#endif  /* BSP_CFG_RTOS_USED == 0 */
}
/******************************************************************************
 End of function usb_hvnd_enumeration
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hvnd_pipe_info
 Description     : Host pipe information check. Set EP table.
 Arguments       : uint8_t *table        : Descriptor start address.
 : uint16_t speed        : Device connected speed
 : uint16_t length       : Configuration Descriptor Length
 Return value    : none
 ******************************************************************************/
void usb_hvnd_pipe_info (uint8_t *table, uint16_t speed, uint16_t length)
{
    uint16_t ofdsc;
    uint16_t pipe_no;
    usb_pipe_table_reg_t    ep_tbl;

    /* Check Endpoint Descriptor */
    ofdsc = table[0];

    /* WAIT_LOOP */
    while (ofdsc < length)
    {
        /* Search within Interface */
        if (USB_DT_ENDPOINT == table[ofdsc + 1])
        {
            pipe_no = usb_hstd_make_pipe_reg_info (USB_IP0, 1, USB_HVND, speed, &table[ofdsc], &ep_tbl);
            if ( USB_NULL == pipe_no)
            {
                return;
            }
            else
            {
                usb_hstd_set_pipe_info (USB_IP0, pipe_no, &ep_tbl);
            }

