renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_hdriver.c
            ofdsc += table[ofdsc];
        }
        else
        {
            ofdsc += table[ofdsc];
        }
    }
}
/******************************************************************************
 End of function usb_hvnd_pipe_info
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hvnd_read_complete
 Description     : Notify application task of data reception completion.
 : (Callback function at completion of INT data reception.)
 Arguments       :
 Return value    : none
 ******************************************************************************/
void usb_hvnd_read_complete (usb_utr_t *ptr, uint16_t data1, uint16_t data2)
{
    usb_ctrl_t ctrl;

    ctrl.module = ptr->ip; /* Module number setting */
    ctrl.pipe = ptr->keyword; /* Pipe number setting */
    ctrl.type = USB_HVND; /* Vendor class  */

    ctrl.size = ptr->read_req_len - ptr->tranlen;
    ctrl.address = usb_hstd_get_devsel(ptr, ctrl.pipe) >> 12;
#if (BSP_CFG_RTOS_USED == 1)
    ctrl.p_data = (void *)ptr->cur_task_hdl;
#endif /* (BSP_CFG_RTOS_USED == 1) */

    switch (ptr->status)
    {
        case USB_DATA_OK :
            ctrl.status = USB_SUCCESS;
        break;
        case USB_DATA_SHT :
            ctrl.status = USB_ERR_SHORT;
        break;
        case USB_DATA_OVR :
            ctrl.status = USB_ERR_OVER;
        break;
        case USB_DATA_ERR :
        default :
            ctrl.status = USB_ERR_NG;
        break;
    }

    usb_set_event(USB_STS_READ_COMPLETE, &ctrl); /* Set Event()  */
}
/******************************************************************************
 End of function usb_hvnd_read_complete()
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hvnd_write_complete
 Description     : Notify application task of data transmission completion.
 : (Callback function at completion of INT data reception.)
 Arguments       :
 Return value    : none
 ******************************************************************************/
void usb_hvnd_write_complete (usb_utr_t *ptr, uint16_t data1, uint16_t data2)
{
    usb_ctrl_t ctrl;

    ctrl.module = ptr->ip; /* Module number setting */
    ctrl.pipe = ptr->keyword; /* Pipe number setting */
    ctrl.type = USB_HVND; /* Vendor class  */
    ctrl.address = usb_hstd_get_devsel(ptr, ctrl.pipe) >> 12;
#if (BSP_CFG_RTOS_USED == 1)
    ctrl.p_data = (void *)ptr->cur_task_hdl;
#endif /* (BSP_CFG_RTOS_USED == 1) */

    if (USB_DATA_NONE == ptr->status)
    {
        ctrl.status = USB_SUCCESS;
    }
    else
    {
        ctrl.status = USB_ERR_NG;
    }

    usb_set_event(USB_STS_WRITE_COMPLETE, &ctrl); /* Set Event()  */
}
/******************************************************************************
 End of function usb_hvnd_write_complete()
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hvnd_registration
 Description     : Host vendor class registration.
 Argument        : usb_utr_t *ptr    : IP info (mode, IP no, reg. address).
 Return          : none
 ******************************************************************************/
void usb_hvnd_registration (usb_utr_t *ptr)
{
    usb_hcdreg_t driver;

    /* Driver registration */

    /* Interface Class */
    driver.ifclass = (uint16_t) USB_IFCLS_VEN;

    /* Target peripheral list */
    driver.p_tpl = (uint16_t*) &g_usb_apl_devicetpl;

    /* Driver init */
    driver.classinit = &usb_hstd_dummy_function;

    /* Driver check */
    driver.classcheck = &usb_hvnd_enumeration;

    /* Device configured */
    driver.devconfig = &usb_hvnd_configured;

    /* Device detach */
    driver.devdetach = &usb_hvnd_detach;

    /* Device suspend */
    driver.devsuspend = &usb_hstd_dummy_function;

    /* Device resume */
    driver.devresume = &usb_hstd_dummy_function;

    usb_hstd_driver_registration(ptr, &driver);

#if USB_CFG_HUB == USB_CFG_ENABLE
#if (BSP_CFG_RTOS_USED == 0)
    usb_cstd_set_task_pri(USB_HUB_TSK, USB_PRI_3);
#endif  /* BSP_CFG_RTOS_USED == 0 */
    usb_hhub_registration(ptr, USB_NULL);
#endif  /* USB_CFG_HUB == USB_CFG_ENABLE */
}
/******************************************************************************
 End of function usb_hvnd_registration
 ******************************************************************************/
#endif /* defined(USB_CFG_HVND_USE) */

#endif  /* (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST */

/******************************************************************************
 End  Of File
 ******************************************************************************/

